In [4]:
import pandas as pd
import pymysql
import mysql.connector

## Importing from the sql database

### Connection using mysql.connector

In [25]:
conn = mysql.connector.connect(host='localhost',user='root',password='Mohit$282',database='supermarket') #mysql workbench connector
conn2 = mysql.connector.connect(host='localhost',user='root',password='',database='')

In [16]:
data = pd.read_sql_query('select * from invoices',conn)

C:\Users\Acer\AppData\Local\Temp\ipykernel_17092\3972229200.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  data = pd.read_sql_query('select * from invoices',conn)

In [46]:
data.head()

,index,Order Id,Date,Meal Id,Company Id,Date of Meal,Participants,Meal Price,Type of Meal
0,0,839FKFW2LLX4LMBB,27-05-2016,INBUX904GIHI8YBD,LJKS5NK6788CYMUU,2016-05-31 07:00:00+02:00,['David Bishop'],469,Breakfast
1,1,97OX39BGVMHODLJM,27-09-2018,J0MMOOPP709DIDIE,LJKS5NK6788CYMUU,2018-10-01 20:00:00+02:00,['David Bishop'],22,Dinner
2,2,041ORQM5OIHTIU6L,24-08-2014,E4UJLQNCI16UX5CS,LJKS5NK6788CYMUU,2014-08-23 14:00:00+02:00,['Karen Stansell'],314,Lunch
3,3,YT796QI18WNGZ7ZJ,12-04-2014,C9SDFHF7553BE247,LJKS5NK6788CYMUU,2014-04-07 21:00:00+02:00,['Addie Patino'],438,Dinner
4,4,6YLROQT27B6HRF4E,28-07-2015,48EQXS6IHYNZDDZ5,LJKS5NK6788CYMUU,2015-07-27 14:00:00+02:00,['Addie Patino' 'Susan Guerrero'],690,Lunch

In [18]:
order_leads = df = pd.read_sql_query('select * from order_leads',conn)

C:\Users\Acer\AppData\Local\Temp\ipykernel_17092\4027452729.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  order_leads = df = pd.read_sql_query('select * from order_leads',conn)

In [19]:
order_leads.head()

,index,Order Id,Company Id,Company Name,Date,Order Value,Converted
0,0,80EYLOKP9E762WKG,LJKS5NK6788CYMUU,Chimera-Chasing Casbah,18-02-2017,4875,1
1,1,TLEXR1HZWTUTBHPB,LJKS5NK6788CYMUU,Chimera-Chasing Casbah,30-07-2015,8425,0
2,2,839FKFW2LLX4LMBB,LJKS5NK6788CYMUU,Chimera-Chasing Casbah,27-05-2016,4837,0
3,3,97OX39BGVMHODLJM,LJKS5NK6788CYMUU,Chimera-Chasing Casbah,27-09-2018,343,0
4,4,5T4LGH4XGBWOD49Z,LJKS5NK6788CYMUU,Chimera-Chasing Casbah,14-01-2016,983,0

## Connection using sqlAlchemy

In [1]:
import pymysql
from sqlalchemy import create_engine

In [23]:
#                                       {username}:{password}@{url_of_the_server}/{database}
engine1 = create_engine("mysql+pymysql://root:Mohit$282@localhost/supermarket")
engine2 = create_engine("mysql+pymysql://root:Mohit$282@localhost/ipl")

In [24]:
pd.read_sql_query('select * from deliveries',con=engine2).head()

,match_id,inning,batting_team,bowling_team,over,ball,batsman,non_striker,bowler,is_super_over,...,bye_runs,legbye_runs,noball_runs,penalty_runs,batsman_runs,extra_runs,total_runs,player_dismissed,dismissal_kind,fielder
0,1,1,Sunrisers Hyderabad,Royal Challengers Bangalore,1,1,DA Warner,S Dhawan,TS Mills,0,...,0,0,0,0,0,0,0,,,
1,1,1,Sunrisers Hyderabad,Royal Challengers Bangalore,1,2,DA Warner,S Dhawan,TS Mills,0,...,0,0,0,0,0,0,0,,,
2,1,1,Sunrisers Hyderabad,Royal Challengers Bangalore,1,3,DA Warner,S Dhawan,TS Mills,0,...,0,0,0,0,4,0,4,,,
3,1,1,Sunrisers Hyderabad,Royal Challengers Bangalore,1,4,DA Warner,S Dhawan,TS Mills,0,...,0,0,0,0,0,0,0,,,
4,1,1,Sunrisers Hyderabad,Royal Challengers Bangalore,1,5,DA Warner,S Dhawan,TS Mills,0,...,0,0,0,0,0,2,2,,,

In [16]:
srh_mi = pd.read_sql_query('select * from deliveries where batting_team = "Sunrisers Hyderabad" and bowling_team = "Mumbai Indians"',con=engine2)

## Connection using pymysql

In [45]:
new_con = pymysql.connect(host='localhost',user='root',password='Mohit$282',database='supermarket')
pd.read_sql_query('select * from invoices',con=new_con).head(3)

C:\Users\Acer\AppData\Local\Temp\ipykernel_17092\964589110.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query('select * from invoices',con=new_con).head(3)

,index,Order Id,Date,Meal Id,Company Id,Date of Meal,Participants,Meal Price,Type of Meal
0,0,839FKFW2LLX4LMBB,27-05-2016,INBUX904GIHI8YBD,LJKS5NK6788CYMUU,2016-05-31 07:00:00+02:00,['David Bishop'],469,Breakfast
1,1,97OX39BGVMHODLJM,27-09-2018,J0MMOOPP709DIDIE,LJKS5NK6788CYMUU,2018-10-01 20:00:00+02:00,['David Bishop'],22,Dinner
2,2,041ORQM5OIHTIU6L,24-08-2014,E4UJLQNCI16UX5CS,LJKS5NK6788CYMUU,2014-08-23 14:00:00+02:00,['Karen Stansell'],314,Lunch

In [40]:
pd.read_sql_query('select * from country limit 5',con=new_con)

## Exporting to the sql database

In [48]:
data.to_sql('data',con=engine1,if_exists='append') #engine1 is connected to database ->supermarket

50017

In [20]:
srh_mi.to_sql('srh_mi_faceToFace',con=engine2) #engine1 is connected to database ->ipl

C:\Users\Acer\AppData\Local\Temp\ipykernel_17508\1440094156.py:1: UserWarning: The provided table name 'srh_mi_faceToFace' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  srh_mi.to_sql('srh_mi_faceToFace',con=engine2) #engine1 is connected to database ->ipl

238